[
{"label": "What are cannabis deficiencies?", "content": [{"images": null, "text": "A cannabis deficiency is seen when the cannabis plant is unable to access a key nutrient or mineral essential for healthy growth. Even if your plants have a relatively healthy diet/feed, the absence of a single essential nutrient can have profound effects. This can have a severe impact on yield and/or quality. In the worst cases, a cannabis deficiency can threaten the survival of your plant."}, {"images": null, "text": "Fortunately for weed growers, the cannabis plant is able to communicate many of the common deficiencies and issues to us. That’s assuming we know what to look for and how to interpret the signs. Visual clues from the leaves and general plant appearance can convey a lot of useful information to the experienced cultivator. Read on to find out more."}]},
{"label": "Nutrients and pH levels for cannabis", "content": null},
{"label": "Cannabis deficiencies and water supply", "content": [{"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/overwatering-and-not-enough-water-cannabis.jpg", "caption": null}], "text": ""}, {"images": null, "text": "Some local water sources can have naturally high levels of some minerals but may be low in others. This can make it tricky to use certain nutrient additives if you already have variable levels in your water supply."}, {"images": null, "text": "That’s why some professional growers try to take the variables within the natural water supply out of the equation and use fully deionised water. This is water that has been specially filtered to remove any mineral ions present. The result is pure water that is free from any mineral content. Some growers prefer to use fully deionised water as the starting point. But this approach tends to be used by a small minority of serious growers. Most cannabis home growers tend to use tap water and find it generally works well enough."}]},
{"label": "Cannabis deficiencies, macronutrients and micronutrients", "content": [{"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/Mobile-and-immobile-nutrients.jpg", "caption": null}], "text": ""}, {"images": null, "text": "Macronutrients are those required in high quantities by your cannabis plants. The main macronutrients for cannabis are Nitrogen, Potassium and Phosphorus. These are used in many of the primary biochemical processes during vegetative growth and bloom."}, {"images": null, "text": "Micronutrients are minerals that are required in trace quantities to ensure that plant cellular biology can function well. Micronutrients include Copper, Silicon, Zinc, Sulphur etc."}]},
{"label": "Mobile nutrients vs immobile nutrients in cannabis deficiencies", "content": [{"images": null, "text": "Understanding the subtle differences between mobile and immobile nutrients can also help the grower understand cannabis deficiencies better. Mobile nutrients such as Phosphorus can be transferred from one part of the plant to another. If that Phosphorus was stored in an old fan leaf before being transferred to another part pf the plant, you will first spot the deficiency in older growth."}, {"images": null, "text": "Other minerals, such as Zinc are immobile minerals. Once deposited by the plant, they are difficult to transfer around the plant. This means that you might initially notice deficiencies of immobile minerals in new growth."}]},
{"label": "Cannabis plant deficiencies and excesses chart", "content": [{"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/cannabis-nutrient-deficiencies-and-excesses-chart.jpg", "caption": null}], "text": "The images and information in this post are partly based on content from Jorge Cervantes. All rights reserved. Visit marijuanagrowing.com for more information."}, {"images": null, "text": "As always with cannabis cultivation, problem prevention is far better than cure. One classic problem with mineral deficiencies is that they are misinterpreted and treated incorrectly which only makes the problem worse. Some of the cannabis deficiencies can look similar and may take an experienced eye to correctly identify."}, {"images": null, "text": "One basic way for soil growers to try to avoid deficiencies is to lean towards larger containers of high quality, professionally prepared soil. With larger quantities of soil, assuming the soil is correctly formulated, the cannabis roots have a larger volume of nutrients to draw from. This reduces the chance of later deficiencies."}, {"images": null, "text": "To further complicate matters, plants can sometimes experience multiple deficiencies especially if they are growing in low quality grow medium. Of course, if the pH is out of range then ‘nutrient lockout’ can occur. This is where nutrients are available but unable to be absorbed."}, {"images": null, "text": ""}, {"images": null, "text": "Related: Optimising your grow room conditions"}, {"images": null, "text": "What is wrong with my cannabis plant?"}, {"images": null, "text": ""}]},
{"label": "How to identify and treat nutrient deficiencies", "content": [{"images": null, "text": "If you are unfortunate enough to have a sick plant with deficiencies it helps to get on top of the situation as quickly as possible. If a plant continues to suffer with deficiencies it will usually mean a severely compromised harvest. In the worst case scenario your plant may not survive. When a plant is in good health it is far more resistant to pests and diseases than a plant which is already compromised by poor health and poor nutrition."}, {"images": null, "text": ""}]},
{"label": "Nitrogen deficiency in cannabis", "content": [{"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/Nitrogen.jpg", "caption": null}], "text": ""}, {"images": null, "text": "Nitrogen (chemical symbol ’N’) is regarded as a mobile macronutrient. Not only is Nitrogen an essential part of plant proteins it is vital for the healthy functioning of photosynthesis, especially in vegetative growth."}, {"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/Nitrogen-Deficiency.jpg", "caption": null}], "text": ""}, {"images": null, "text": "Symptoms Nitrogen deficiency can result in leaves looking pale, and eventually turning yellow, curling and dropping off. Leaves nearer the base of the plant can be first to display it. Yellowing can progress up the plant. Leaf discolouration/browning can occur.  Bloom may seem to be faster, with lower yields and fewer bud points."}, {"images": null, "text": "Nitrogen toxicity If Nitrogen levels are too high leaves can show an unnaturally deep/dark hue. This can be fixed with a decrease in nutrients, or a quick flush of your plant container to remove the excess nutrients. How to treat Nitrogen deficiency in cannabis Many standard nutrients contain high levels of Nitrogen and are usually a quick fix. Fish-based nutrients are often rich in nitrogen-containing amines. Check that your nutrient pH is OK. Consider a light foliar feed spray with a nitrogen rich nutrient, such as a seaweed or fish based foliar spray. Cannabis leaves can absorb small amounts of nutrients directly through the leaf surface. This makes foliar feeding a great option."}, {"images": null, "text": ""}]},
{"label": "Phosphorus deficiency in cannabis", "content": [{"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/PHOSPHORUS.jpg", "caption": null}], "text": ""}, {"images": null, "text": "Just like Nitrogen, Phosphorus (chemical Symbol ‘P’) is a mobile macronutrient which is essential to plant health and growth. It is used in the formation of plant proteins, plant DNA and is essential for proper photosynthesis to occur."}, {"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/PHOSPHOROUS-deficiency plant and leaf.jpg", "caption": null}], "text": ""}, {"images": null, "text": "Symptoms If you have ever seen dry leaves with areas of brown discolouration then you may well have seen Phosphorus deficiency yourself. It may also cause red/purple collations (or dead spots) in the petioles (leaf stems). The leaves may subsequently take on a dark blue/green hue. If left unchecked, Phosphorus deficiency slows vertical and horizontal growth significantly. Dark, blackish spots can appear on leaves. Leaves can curl and drop, possibly showing hints of a metallic purple or a dark bronze appearance."}, {"images": null, "text": "How to treat it Keeping your pH nearer the acidic side (closer to pH 6) can help increase bio-availability. Adding a Phosphorus rich feed/fertiliser is recommended. Fish meal or worm castings are a good organic alternative. Ensure your temperatures are in range, cool temperatures seem to make it more difficult for effective Phosphorus uptake. Ensure you’re not over-watering."}, {"images": null, "text": "How to prevent it Try to use a grow medium rich in Phosphorus. To make the soil easier to grow in and easier to use, try using a well aerated grow container such as an airpot which will allow better soil oxygenation levels. Perhaps some manure (well rotted) in your compost will help. Use of beneficial mycorrhizal fungi will help with overall soil health. The microbes may also help convert less soluble phosphates into soluble forms which are easier for your cannabis plant to absorb and utilise."}, {"images": null, "text": ""}]},
{"label": "Potassium deficiency in cannabis", "content": [{"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/POTASSIUM.jpg", "caption": null}], "text": ""}, {"images": null, "text": "Alongside Phosphorus and Nitrogen, Potassium (chemical symbols is ‘K’) is the other main mobile macronutrient used by the cannabis plant. Potassium is vital for the synthesis and transportation of sugars and simple carbohydrates. Potassium is also required to enable transpiration/water uptake as well as root growth and cell division. Potassium is also vital for the production of Adenosine Triphosphate (‘ATP’) which is a measure of cellular energy."}, {"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/POTASSIUM-deficiency-leaf-and-plant.jpg", "caption": null}], "text": ""}, {"images": null, "text": "Symptoms You may see curling leaves as well as brown and yellow colours on leaf tips and leaf edges. Your plants may stretch more than normal with a Potassium deficiency."}, {"images": null, "text": "How to treat it Some growers like to flush their grow medium to ensure they are not dealing with other issues, such as overfeeding which can interfere with Potassium uptake. Chicken manure as a top dressing to your grow medium can help, as can a Potassium rich nutrient feed or foliar feed. Organic seaweed is particularly useful as a foliar feed."}, {"images": null, "text": ""}]},
{"label": "Magnesium deficiency in cannabis", "content": [{"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/magnesium.jpg", "caption": null}], "text": ""}, {"images": null, "text": "Magnesium (chemical symbol ‘Mg’) is a mobile micronutrient. It is essential for photosynthesis and is used to make the vital chlorophyll pigment. Without Magnesium, chlorophyll and photosynthesis simply can’t happen."}, {"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/mag-deficiency.jpg", "caption": null}], "text": ""}, {"images": null, "text": "Symptoms The leaves start to show yellow spots which eventually turn brown causing leaves to die. Areas between the veins of older leaves turn yellow (interveinal chlorosis) and may also show rust coloured spots. If left untreated, Magnesium deficiency can seriously diminish a plants ability to produce any type of harvest."}, {"images": null, "text": "How to treat it If pH is outside the desired range, flush your grow medium with water (preferably at pH 6 or thereabouts). Epsom salts are often used to fix the problem. Try adding a teaspoon of epsom salts to a litre of water and seeing how your plants respond to a feed. Some people benefit from water with naturally high levels of Magnesium. Try doing a google search for water analysis where you live. In many countries, water analysis has to be legally available, showing you the precise levels of trace minerals that you can typically expect to be present. But remember, water composition and pH can vary at different times of the year."}, {"images": null, "text": "How to prevent Magnesium deficiency As with all cannabis deficiencies, prevention is better than cure. By the time you see the signs of a Magnesium deficiency your plant may already have been feeling the effects for a month or so. Use good quality compost, large containers will contain more grow nutrients than small containers. You may wish to include some powdered dolomite limestone mixed into your grow medium. This is Magnesium-rich and slowly breaks down releasing Magnesium for the roots to uptake. Specialist Calcium/Magnesium rich nutrients can also be bought in grow shops."}, {"images": null, "text": ""}]},
{"label": "Calcium deficiency in cannabis", "content": [{"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/Calcium.jpg", "caption": null}], "text": ""}, {"images": null, "text": "Calcium (chemical symbol ‘Ca’) is an immobile micronutrient, but one which has an essential role in the plant structure. Calcium helps fortify the cell walls. A Calcium deficiency can therefore result in warped structure/lack of structure to new growth. Calcium also helps the flow of Nitrogen and sugars through the plant."}, {"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/calcium-deficiency.jpg", "caption": null}], "text": ""}, {"images": null, "text": "Symptoms Leaves, especially lower ones can curl and take on unusual shapes. You may also observe yellow/brown spots. These can have brown borders and will grow over time as the problem continues. Root health is also damaged by Calcium deficiency, root tips will slowly die. The result is a stunted plant which will struggle to recover in the worst cases."}, {"images": null, "text": "How to treat it A Calcium/Magnesium nutrient supplement is a fast and direct solution. Ensure your feed pH hasn't become too alkaline and is in range. If you don't have a Ca/Mg supplement, you can try adding a teaspoon of hydrated lime to around 4 litres of water and using this as a feed. A good way to prevent Calcium deficiency (prevention is always better than cure) is to add some powdered dolomite lime to your grow medium."}, {"images": null, "text": ""}]},
{"label": "Boron deficiency in cannabis", "content": [{"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/Boron.jpg", "caption": null}], "text": ""}, {"images": null, "text": "Boron (chemical symbol ‘B’) is used together with Calcium to ensure healthy cell walls and effective cell division. Boron is an immobile macronutrient. It is required in small amounts, so it is one of the less common cannabis nutrient deficiencies to see. Most good quality soils/compost contain sufficient Boron."}, {"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/Boron-deficiency.jpg", "caption": null}], "text": ""}, {"images": null, "text": "Symptoms A lack of Boron will produce a plant that looks like it’s wilting, the technical term is lack of turgor. Vegetative growth will be poor, new growth can appear twisted. The leaves can show a yellow/brownish discolouration."}, {"images": null, "text": "How to treat it Flush your grow medium and add some extra Boron. This is done by adding a teaspoon of Boric acid to 3-4 litres of water and feeding to your plant."}, {"images": null, "text": ""}]},
{"label": "Copper deficiency in cannabis", "content": [{"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/Copper.jpg", "caption": null}], "text": ""}, {"images": null, "text": "Copper (chemical symbols ‘Cu’) is a macro nutrient which is semi-mobile. It helps the plant utilise Nitrogen as well as assisting in the metabolism of carbohydrates. It’s unusual to see genuine cases of copper deficiency, most grow mediums and feeds have sufficient Copper for the plant requirements."}, {"images": null, "text": "Symptoms You will see slow wilting occurring. New growth can appear to twist and turn as it grows."}, {"images": null, "text": "How to treat it Treating deficiencies of mobile macronutrients such as Nitrogen, Phosphorus and Potassium is more straightforward than treating more complicated deficiencies involving micro nutrients of heavier metals such as Molybdenum, Iron, Copper etc. Getting the correct dosing required, and the correct form of the mineral isn’t easy. Who really wants to be dosing their cannabis plants with heavy metals when they plan to be smoking the weed a few weeks later? Prevention of these deficiencies is the only real way to go."}, {"images": null, "text": ""}]},
{"label": "Iron deficiency in cannabis", "content": [{"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/Iron.jpg", "caption": null}], "text": ""}, {"images": null, "text": "Iron (chemical symbol ‘Fe’) is a semi-mobile macro nutrient. It is necessary in the use of nitrates (Nitrogen containing) and sulphates (Sulphur containing) compounds. Iron is also required for the production of chlorophyll. Iron deficiencies can occur if pH is out of range. It can also be caused by excess Zinc, Manganese or Copper. All of these can interfere with Iron uptake. Iron is an important mineral for processes involved in general metabolic and energy-forming processes."}, {"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/iron-deficiency-leaf-and-plant.jpg", "caption": null}], "text": ""}, {"images": null, "text": "Symptoms Symptoms of Iron deficiency can initially appear in new plant growth. Interveinal chlorosis can appear at the base of new leaves. After this, the same symptoms can be seen through the leaves and older growth. Overall yellowing between the leaf veins is a good indicator of Iron deficiency."}, {"images": null, "text": ""}]},
{"label": "Manganese deficiency in cannabis", "content": [{"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/Manganese.jpg", "caption": null}], "text": ""}, {"images": null, "text": "Manganese (‘Mn’) is an immobile micronutrient. It helps with several important cell functions including nitrogen use, respiration and photosynthesis. Root cell growth is aided by Manganese, which also protects roots from less useful/bad microbes. It’s unusual to see genuine cases of Manganese deficiency. Often it is related to excess Iron or high pH."}, {"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/Manganese-deficiency.jpg", "caption": null}], "text": ""}, {"images": null, "text": "Symptoms Just like other immobile nutrient deficiencies, Manganese deficiency tends to show up as pale discolouration (chlorosis) near the base of new plant growth. This can eventually spread out to effect the tips of leaves and brown (necrotic) spots start to appear, eventually on older leaves. The leaf margins and veins can appear green while the interveinal areas can start to yellow."}, {"images": null, "text": ""}]},
{"label": "Molybdenum deficiency in cannabis", "content": [{"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/Molybdenum.jpg", "caption": null}], "text": ""}, {"images": null, "text": "Molybdenum (chemical symbol ‘Mo’) is a mobile micronutrient. It is essential for the correct function of two important enzyme systems which convert nitrates to ammonium compounds (for amino acid formation and subsequent plant protein production). Again, genuine deficiencies are rare and difficult to correct."}, {"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/Molybdenum-deficiency-leaf-plant.jpg", "caption": null}], "text": ""}, {"images": null, "text": "Symptoms Genuine deficiencies are scarce, they can be exacerbated by cold weather. You may see a yellowing of older leaves which may also show interveinal chlorosis. The leaves may ‘cup’ and curl upwards before twisting and dying."}, {"images": null, "text": ""}]},
{"label": "Silicon deficiency in cannabis", "content": [{"images": null, "text": "Silicon is an immobile micronutrient which has attracted a lot of attention in recent years. Genuine cases of Silicon deficiency are uncommon. It’s a mineral that strengthens cellular walls, allowing sturdy growth and strong plants. Specialist liquid Silicon feeds are available, though most growers use them in the hope of stronger plants rather than for trying to fix a deficiency."}, {"images": null, "text": ""}]},
{"label": "Sulfur deficiency in cannabis", "content": [{"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/Sulfur.jpg", "caption": null}], "text": ""}, {"images": null, "text": "Sulphur (or Sulfur) is a critical immobile micronutrient. It’s used for vital enzymes and proteins. Sulphur is essential to plant respiration as well as for the synthesis and breakdown of fatty acids. It also plays an important role in the synthesis of oils and terpenes. Deficiencies of Sulphur may be caused by the loss of Phosphorous (due to a high pH level) in the root zone."}, {"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/sulfur-deficiency-plant-leafs.jpg", "caption": null}], "text": ""}, {"images": null, "text": "Symptoms It’s uncommon to see Sulphur deficiency, but if you have it you may see young leaves turning lime green before turning yellow. You may observe stunted growth followed by the gradual yellowing of leaf veins. The leaves may also be dry and brittle. Continued deficiency results in lowered potency and inferior yields."}, {"images": null, "text": ""}]},
{"label": "Zinc deficiency in cannabis", "content": [{"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/Zinc.jpg", "caption": null}], "text": ""}, {"images": null, "text": "Zinc (chemical symbols Zn) is a metallic immobile micro nutrient. It’s important for the production of sugar and protein. Zinc is also used to make chlorophyll as well as for healthy stem growth. Deficiencies can be seen especially where alkaline soils and dry climates are present. It may also be the result of acidic pH levels. Zinc is only required in small quantities, but it is vital for the formation of cell membranes, proteins and plant growth hormones."}, {"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/Zinc-deficiency.jpg", "caption": null}], "text": ""}, {"images": null, "text": "Symptoms New leaves and new plant growth tend to show interveinal chlorosis. The blades of the cannabis leaf may look wrinkled, yellow and distorted. The leaf tips will discolor (yellow) and may show brown burn at the tips. The leaves may rotate 90º sideways."}, {"images": null, "text": ""}]},
{"label": "Diagnosing common cannabis plant problems", "content": [{"images": null, "text": "The problem with emerging plant health issues is that they can be easily confused and misidentified. Many deficiencies, for example, involve the leaves yellowing in one way or another. Misdiagnosing the problem may well leave the problem unfixed - the plant continues to struggle and may even develop new issues as a result of the incorrect treatment provided."}, {"images": null, "text": "Simply overwatering your plant and leaving it a cold room may also result in yellowing/browning of leaves. This could be misidentified as a deficiency of nutrients/minerals. The experienced grower tends to avoid cannabis deficiencies by preparing for the grow with the right conditions, a consistent grow medium and reliable nutrients."}, {"images": null, "text": "A grower that regularly experiences nutrient deficiencies when growing in 5 litre soil containers might find that switching to a larger grow container of around 20 litres helps. The cannabis roots have a larger reserve of nutrients to use, this allows them to develop a larger and stronger root network and build a larger plant with less risk of deficiencies. Another useful tip might be to use some slow release organic nutrients which will gradually replenish the soil health. BioTabs offer some highly recommended slow release organic nutrients which produce great results and should prevent the risk of nutrient deficiencies."}, {"images": null, "text": "Growers using hydroponic systems may find that refreshing their nutrient reservoir more frequently reduces the risk of their tank running low in an important nutrient."}, {"images": [{"image_url": "https://dutch-passion.com/img/cms/Blogs/Biotabs-starterkit-image.jpg", "caption": null}], "text": ""}]},
{"label": "How to keep cannabis plants healthy throughout their lifecycle", "content": [{"images": null, "text": "Nutrient management is one of the key skills for any successful cannabis grower. Finding a grow method/system that works consistently well for you is one of the basics of cannabis growing. Likewise, finding a nutrient supplier you can trust is vital. Fortunately, the vast majority of growers find that growing cannabis is easy. It’s called weed for good reasons, and can be grown successfully in a wide range of grow medium and grow systems."}, {"images": null, "text": "You can grow weed indoors, in a greenhouse or outdoors. If you use nutrients from any of the larger, established, suppliers you should get good results. Many nutrient companies have been selling proven nutrients for many years with solid, consistent results. If you have a good local grow shop you should find plenty of qualified help."}]}
]